app/controllers/forums_controller.rb

	def index
		@forums = Forum.all
---
SELECT "forums".* FROM "forums"

	def create
		title = params[:forum][:title]

		if title.nil? || title.empty?
			redirect_to new_forum_path
			return
		end
		@forum = Forum.new(forum_params)
		@forum.save
---
INSERT INTO "forums" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 27 Sep 2014 20:13:50 UTC +00:00], ["description", "This is the second forum."], ["title", "Second Forum"], ["updated_at", Sat, 27 Sep 2014 20:13:50 UTC +00:00]]